/*
====================================================================
Welcome to the metadata! (It's like settings. But fancier!)
====================================================================
*/

{
    /*
    The main settings to change. Determine where your files are saved to and all sorts of set information.
    */
    "file_settings":
    {
        // The output filepath. Make this whatever you want.
        "output_filepath": ".\\Outputs\\",
        "input_filepath": ".\\Inputs\\",
        // The name of the card data file to be put into the Inputs folder.
        "spreadsheet_file_name": "Cards.csv",
    
        // The URL that your card images will be pulled from.
        // --> Cockatrice can pull from this URL and download your cards on the 
        // fly so your friends don't need to constantly download the updated card images.
        // --> Draftmancer can use it to display the card images while drafting.
        "uploaded_images_base_url": "https://roey-shap.github.io/MtGDoD3/Playtest_Card_Images/",
        // The set code. Typically 3 characters long. For example, Duskmourn's code is DSK.
        "set_code": "TEST",
        // Just a name. Put whatever you want here.
        "set_longname": "SET_LONGNAME",
        // Your set's version number. In theory can be used in Cockatrice to differentiate between different versions
        // of the same set, but I wouldn't recommend it.
        // --- Version code must be in XX_XX format! ---
        // Exactly 1 underscore! i.e. 12_0 is ok, 12_123 is ok,  1_ is not, 123 is not, and 1_2_3 is not.
        "set_version_code": "1_0",
        // Also just a number. You can sort by release date in Cockatrice, so please use YYYY-MM-DD format.
        "release_date": "2024-09-08"
    },

    /*
    Alter the way card images are generated.
    Line spacings, pip sizes, etc.
    */
    "card_image_settings":
    {
        "card_line_height_between_abilities": 1.4,
        "card_line_height_normal": 1.035
    },

    "card_semantics_settings":
    {
        // Controls whether or not to replace a special character with the card's actual name.
        // It's typical to see a special placeholder name in test cards where one hasn't been decided yet.
        // The one I always see is tilde (~). Another common one is CARDNAME. Chose whatever you'd like!
        // For example, if I put "~ enters with a +1/+1 counter." on the spreadsheet and name my card "Dude", the final result
        // will be an image with body text "Dude enters with a +1/+1 counter."
        "replace_reference_string_with_cardname": true,
        "reference_card_name":  "~",
        // If you didn't have time to do rarities, just set this to false and you won't be warned about it!
        "rarities_should_be_in_place": true,
        // Give updates about card errors and file accesses as the program runs.
        "verbose_mode_cards": false,
        "verbose_mode_files": false,
        // Turning this off makes warnings not appear at ALL, even in the program log
        // @TODO: Should warn about things like mana symbols being out of order and corrected. 
        // Maybe also templating issues?
        "warn_about_card_semantics_errors": true
    },
    "asset_loading_settings":
    {
        // Set to true if you want a new log each time you run the program...
        // ... so you can keep track of errors you've fixed over time.
        "make_unique_program_run_log": false,
        // Set to true if you want the program to always regenerate the hybrid color borders
        // and other card frames from the few base frames 
        "always_regenerate_base_card_frames": false
    }
}
